# 0 - Import

In [42]:
import pandas as pd
from ydata_profiling import ProfileReport
import matplotlib.pyplot as plt

In [43]:
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)

# 1 - Load file

In [44]:
df = pd.read_csv("marketing_campaign.csv", sep='\t')
df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,88,546,172,88,88,3,8,10,4,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,1,6,2,1,6,2,1,1,2,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,49,127,111,21,42,1,8,2,10,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,4,20,10,3,5,2,2,0,4,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,43,118,46,27,15,5,5,3,6,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,43,182,42,118,247,2,9,3,4,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,0,30,0,0,8,7,8,2,5,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,48,217,32,12,24,1,2,3,13,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,30,214,80,30,61,2,6,5,10,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,3,61,2,1,21,3,3,1,4,7,0,0,0,0,0,0,3,11,1

## Check dataset

In [45]:
# Check data size
print(f"{df.shape[0]} rows, {df.shape[1]} columns")

2240 rows, 29 columns

In [46]:
# Value type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

In [47]:
# Check null
df.isna().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [48]:
## Check duplicates
df.duplicated().sum()

0

# 2 - Data Preparation

## Drop null rows

In [49]:
df.dropna(inplace= True)

## Type Casting

In [50]:
# Convert Dt_Customer to datetime value
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'], dayfirst = True)
print(df['Dt_Customer'].min())
print(df['Dt_Customer'].max())

2012-07-30 00:00:00
2014-06-29 00:00:00

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2216 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2216 non-null   int64
 1   Year_Birth           2216 non-null   int64
 2   Education            2216 non-null   object
 3   Marital_Status       2216 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2216 non-null   int64
 6   Teenhome             2216 non-null   int64
 7   Dt_Customer          2216 non-null   datetime64[ns]
 8   Recency              2216 non-null   int64
 9   MntWines             2216 non-null   int64
 10  MntFruits            2216 non-null   int64
 11  MntMeatProducts      2216 non-null   int64
 12  MntFishProducts      2216 non-null   int64
 13  MntSweetProducts     2216 non-null   int64
 14  MntGoldProds         2216 non-null   int64
 15  NumDealsPurchases    2216 non-null   int64
 16  NumWebPurchases      2216 non-null   int64
 17  NumCatalogPurchases  2216 non-null   int64
 18  NumStorePurchases    2216 non-null   int64
 19  NumWebVisitsMonth    2216 non-null   int64
 20  AcceptedCmp3         2216 non-null   int64
 21  AcceptedCmp4         2216 non-null   int64
 22  AcceptedCmp5         2216 non-null   int64
 23  AcceptedCmp1         2216 non-null   int64
 24  AcceptedCmp2         2216 non-null   int64
 25  Complain             2216 non-null   int64
 26  Z_CostContact        2216 non-null   int64
 27  Z_Revenue            2216 non-null   int64
 28  Response             2216 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(25), object(2)
memory usage: 519.4+ KB

## Define `last_day`, `age`, `lifespan_months`

Because we cannot define the last day of the dataset, so it is assumed that:
- last_day = max(Dt_customer + Recency)

In [52]:
# Calculate last day
last_date = df.apply(lambda row: row['Dt_Customer'] + pd.DateOffset(days=row['Recency']), axis=1).max()
print(last_date)

2014-10-04 00:00:00

In [53]:
# Add customer's age
df['Age'] = 2014 - df['Year_Birth']

We want to know how long customer has been with us, so we calculate
- lifespan_months = (last_date - Dt_Customer) / 30

In [54]:
df['lifespan_months'] = (last_date - df['Dt_Customer']).dt.days // 30

## Clean `Marital_Status`, `Children` and define `Family_size`

In [55]:
df['Marital_Status'].value_counts()

Married     857
Together    573
Single      471
Divorced    232
Widow        76
Alone         3
Absurd        2
YOLO          2
Name: Marital_Status, dtype: int64

Martial status dont need to have that much categories, we can just combine them into `Single` and `Couple`

In [56]:
clean_marital_status = {
    'Married':  'Couple',
    'Together': 'Couple',
    'Single':   'Single',
    'Divorced': 'Single',
    'Widow':    'Single',
    'Alone':    'Single',
    'Absurd':   'Single',
    'YOLO':     'Single'
}
df['Marital_Status'] = df['Marital_Status'].replace(clean_marital_status)

In [57]:
df['Marital_Status'].value_counts()

Couple    1430
Single     786
Name: Marital_Status, dtype: int64

In [58]:
df[['Kidhome','Teenhome']].head(3)

   Kidhome  Teenhome
0        0         0
1        1         1
2        0         0

We can comebine `Kidhome` and `Teenhome` and define as number of `Children`

In [59]:
df['Children'] = df['Kidhome'] + df['Teenhome']

In [60]:
df['Children'].value_counts()

1    1117
0     633
2     416
3      50
Name: Children, dtype: int64

`Family_size` is assumed to be customer's status (1 if Single, 2 if Couple) + number of `Children`

In [61]:
df['Family_size'] = df['Marital_Status'].apply(lambda x: 1 if x == 'Single' else 2) + df['Children']

In [62]:
df['Family_size'].value_counts()

3    880
2    757
4    296
1    252
5     31
Name: Family_size, dtype: int64

## Clean `Education` column

In [63]:
df['Education'].value_counts()

Graduation    1116
PhD            481
Master         365
2n Cycle       200
Basic           54
Name: Education, dtype: int64

Education can also be grouped into: `Undergraduate` and `Postgraduate`

In [64]:
clean_education = {
    'Graduation':   'Postgraduate',
    'PhD':          'Postgraduate',
    'Master':       'Postgraduate',
    'Basic':        'Undergraduate',
    '2n Cycle':     'Undergraduate'
}
df['Education'] = df['Education'].replace(clean_education)

In [65]:
df['Education'].value_counts()

Postgraduate     1962
Undergraduate     254
Name: Education, dtype: int64

## Define `Frequency` column

In [66]:
df[['NumWebPurchases', 'NumCatalogPurchases', 'NumStorePurchases']].head(3)

   NumWebPurchases  NumCatalogPurchases  NumStorePurchases
0                8                   10                  4
1                1                    1                  2
2                8                    2                 10

We can comebine the times people made purchases through `Web`, `Catalog`, `Store` into one column `Frequency`

In [67]:
df['Frequency'] = (df['NumWebPurchases'] + df['NumCatalogPurchases'] + df['NumStorePurchases'])

## Define `Monetary` column

In [68]:
df[["MntWines", "MntFruits", "MntMeatProducts","MntFishProducts", "MntSweetProducts", "MntGoldProds"]].head(3)

,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
0,635,88,546,172,88,88
1,11,1,6,2,1,6
2,426,49,127,111,21,42

We combine all the amount spent for each product into 1 column `Amount_spent`

In [69]:
df['Monetary'] = df[["MntWines", "MntFruits", "MntMeatProducts","MntFishProducts", "MntSweetProducts", "MntGoldProds"]].sum(axis=1)

## Define `Responder` column

In [70]:
df[['AcceptedCmp1','AcceptedCmp2','AcceptedCmp3','AcceptedCmp4','AcceptedCmp5','Response']].head(3)

,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response
0,0,0,0,0,0,1
1,0,0,0,0,0,0
2,0,0,0,0,0,0

There are 6 columns on Customer accepted the offer in the promotion campaign. We can combine them together, then segment as below:
- Accepted 4 to 6 offers: High responder
- Accepted 1 to 3 offers: Low responder
- Not accepted any offers: Non-responder

In [71]:
# Calculate sum promotion accepted
df['PromoAccepted'] = df[['AcceptedCmp1','AcceptedCmp2','AcceptedCmp3','AcceptedCmp4','AcceptedCmp5','Response']].sum(axis=1)

# Responder segments
df['Responder'] = 'None'
df.loc[df['PromoAccepted'].between(1,3), 'Responder'] = 'Low'
df.loc[df['PromoAccepted'] >= 4, 'Responder'] = 'High'

In [72]:
df.groupby(['Responder','PromoAccepted'])['ID'].count()

Responder  PromoAccepted
High       4                  36
           5                  10
Low        1                 369
           2                 139
           3                  51
None       0                1611
Name: ID, dtype: int64

## Output cleaned data

In [73]:
df.head(3)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response,Age,lifespan_months,Children,Family_size,Frequency,Monetary,PromoAccepted,Responder
0,5524,1957,Postgraduate,Single,58138.0,0,0,2012-09-04,58,635,88,546,172,88,88,3,8,10,4,7,0,0,0,0,0,0,3,11,1,57,25,0,1,22,1617,1,Low
1,2174,1954,Postgraduate,Single,46344.0,1,1,2014-03-08,38,11,1,6,2,1,6,2,1,1,2,5,0,0,0,0,0,0,3,11,0,60,7,2,3,4,27,0,None
2,4141,1965,Postgraduate,Couple,71613.0,0,0,2013-08-21,26,426,49,127,111,21,42,1,8,2,10,4,0,0,0,0,0,0,3,11,0,49,13,0,2,20,776,0,None

In [74]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response',
       'Age', 'lifespan_months', 'Children', 'Family_size', 'Frequency',
       'Monetary', 'PromoAccepted', 'Responder'],
      dtype='object')

In [76]:
customer_data = df[['ID', 'Age','Education','Marital_Status','Children','Family_size','Income','lifespan_months']].copy()
rfm_data = df[['ID','Recency','Frequency','Monetary']].copy()
marketing_data = df[['ID','NumDealsPurchases','PromoAccepted','Responder']].copy()

In [77]:
customer_data

,ID,Age,Education,Marital_Status,Children,Family_size,Income,lifespan_months
0,5524,57,Postgraduate,Single,0,1,58138.0,25
1,2174,60,Postgraduate,Single,2,3,46344.0,7
2,4141,49,Postgraduate,Couple,0,2,71613.0,13
3,6182,30,Postgraduate,Couple,1,3,26646.0,7
4,5324,33,Postgraduate,Couple,1,3,58293.0,8
...,...,...,...,...,...,...,...,...
2235,10870,47,Postgraduate,Couple,1,3,61223.0,15
2236,4001,68,Postgraduate,Couple,3,5,64014.0,3
2237,7270,33,Postgraduate,Single,0,1,56981.0,8
2238,8235,58,Postgraduate,Couple,1,3,69245.0,8
2239,9405,60,Postgraduate,Couple,2,4,52869.0,23

In [78]:
rfm_data

         ID  Recency  Frequency  Monetary
0      5524       58         22      1617
1      2174       38          4        27
2      4141       26         20       776
3      6182       26          6        53
4      5324       94         14       422
...     ...      ...        ...       ...
2235  10870       46         16      1341
2236   4001       56         15       444
2237   7270       91         18      1241
2238   8235        8         21       843
2239   9405       40          8       172

[2216 rows x 4 columns]

In [79]:
marketing_data

         ID  NumDealsPurchases  PromoAccepted Responder
0      5524                  3              1       Low
1      2174                  2              0      None
2      4141                  1              0      None
3      6182                  2              0      None
4      5324                  5              0      None
...     ...                ...            ...       ...
2235  10870                  2              0      None
2236   4001                  7              1       Low
2237   7270                  1              1       Low
2238   8235                  2              0      None
2239   9405                  3              1       Low

[2216 rows x 4 columns]

# 3 - RFM modeling

From `rfm_data` we need to add score for each values. The method using here will be:
- Define score for `Recency`, `Frequency` and `Monetary` from 1 to 5
- Each score is the evenly separated range for each columns
- Based on `Recency_score` and `Frequency_score`, the results are defined below

| Segment | Frequency_score | Recency_score |
|---|:---:|:---:|
| Champion | 5 | 5 |
| Loyal Customer | 5 or 4 | 3 or 4 |
| Potential Customer | 3 or 2 | 5 or 4 |
| Need Attention | 3 | 3 |
| New Customer | 1 | 5 |
| Promising | 1 | 4 |
| About to sleep | 2 or 1 | 3 |
| Can’t loose them | 5 | 1 or 2 |
| At risk | 4 or 3 | 1 or 2 |
| Hibernating | 1 or 2 | 1 or 2 |

In [80]:
rfm_data

         ID  Recency  Frequency  Monetary
0      5524       58         22      1617
1      2174       38          4        27
2      4141       26         20       776
3      6182       26          6        53
4      5324       94         14       422
...     ...      ...        ...       ...
2235  10870       46         16      1341
2236   4001       56         15       444
2237   7270       91         18      1241
2238   8235        8         21       843
2239   9405       40          8       172

[2216 rows x 4 columns]

In [81]:
# The lower the recency the better
rfm_data["Recency_score"] = pd.qcut(rfm_data['Recency'].rank(method="first"), 5, labels=[5, 4, 3, 2, 1])

# The higher the frequency and monetary the better
rfm_data["Frequency_score"] = pd.qcut(rfm_data['Frequency'].rank(method="first"), 5, labels=[1, 2, 3, 4, 5])
rfm_data["Monetary_score"] = pd.qcut(rfm_data['Monetary'].rank(method="first"), 5, labels=[1, 2, 3, 4, 5])

In [95]:
# RMF segments
rfm_data['Segment'] = "Non-defined"
rfm_data.loc[(rfm_data['Frequency_score'].isin([5, 4]))  & (rfm_data['Recency_score'] == 5), 'Segment']         = "Champion"
rfm_data.loc[(rfm_data['Frequency_score'].isin([5, 4]))  & (rfm_data['Recency_score'].isin([3, 4])), 'Segment'] = "Loyal Customer"
rfm_data.loc[(rfm_data['Frequency_score'].isin([3, 2]))  & (rfm_data['Recency_score'].isin([5, 4])), 'Segment'] = "Potential Customer"
rfm_data.loc[(rfm_data['Frequency_score'] == 3)          & (rfm_data['Recency_score'] == 3), 'Segment']         = "Need Attention"
rfm_data.loc[(rfm_data['Frequency_score'] == 1)          & (rfm_data['Recency_score'] == 5), 'Segment']         = "New Customer"
rfm_data.loc[(rfm_data['Frequency_score'] == 1)          & (rfm_data['Recency_score'] == 4), 'Segment']         = "Promising"
rfm_data.loc[(rfm_data['Frequency_score'].isin([2, 1]))  & (rfm_data['Recency_score'] == 3), 'Segment']         = "About to sleep"
rfm_data.loc[(rfm_data['Frequency_score'] == 5)          & (rfm_data['Recency_score'].isin([1, 2])), 'Segment'] = "Can’t loose them"
rfm_data.loc[(rfm_data['Frequency_score'].isin([4, 3]))  & (rfm_data['Recency_score'].isin([1, 2])), 'Segment'] = "At risk"
rfm_data.loc[(rfm_data['Frequency_score'].isin([1, 2]))  & (rfm_data['Recency_score'].isin([1, 2])), 'Segment'] = "Hibernating"

In [96]:
rfm_data['Segment'].value_counts()

At risk               361
Loyal Customer        354
Potential Customer    349
Hibernating           343
Can’t loose them      182
About to sleep        180
Champion              177
Promising              95
New Customer           90
Need Attention         85
Name: Segment, dtype: int64

In [97]:
rfm_data

,ID,Recency,Frequency,Monetary,Recency_score,Frequency_score,Monetary_score,Segment
0,5524,58,22,1617,3,5,5,Loyal Customer
1,2174,38,4,27,4,1,1,Promising
2,4141,26,20,776,4,4,4,Loyal Customer
3,6182,26,6,53,4,2,1,Potential Customer
4,5324,94,14,422,1,3,3,At risk
...,...,...,...,...,...,...,...,...
2235,10870,46,16,1341,3,4,5,Loyal Customer
2236,4001,56,15,444,3,4,3,Loyal Customer
2237,7270,91,18,1241,1,4,5,At risk
2238,8235,8,21,843,5,5,4,Champion
2239,9405,40,8,172,3,2,2,About to sleep

# 4 - Export to csv

In [98]:
customer_data.to_csv("final_customer_data.csv")
rfm_data.to_csv("final_rfm_data.csv")
marketing_data.to_csv("final_marketing_data.csv")